// 440	字典序的第K小数字	困难		
// 351	安卓系统手势解锁	中等		
// 135	分发糖果	困难		
// 420	强密码检验器	困难		
// 1057	校园自行车分配	中等		
// 460	LFU缓存	困难		
// 726	原子的数量	困难		
// 1274	矩形内船只的数目	困难		
// 803	打砖块	困难		
// 393	UTF-8 编码验证	中等		
// 42	接雨水	困难		
// 1012	至少有 1 位重复的数字	困难		
// 317	离建筑物最近的距离	困难		
// 146	LRU缓存机制	中等		
// 834	树中距离之和	困难		
// 670	最大交换	中等		
// 952	按公因数计算最大组件大小	困难		
// 786	第 K 个最小的素数分数	困难		
// 1014	最佳观光组合	中等		
// 194	转置文件	中等
// 365	水壶问题	中等		
// 564	寻找最近的回文数	困难		
// 742	二叉树最近的叶节点	中等		
// 755	倒水	中等		
// 943	最短超级串	困难		
// 913	猫和老鼠	困难		
// 25	K 个一组翻转链表	困难		
// 1066	校园自行车分配 II	中等		
// 1203	项目管理	困难		
// 1202	交换字符串中的元素	中等		
// 386	字典序排数	中等		
// 1262	可被三整除的最大和	中等		
// 1044	最长重复子串	困难		
// 862	和至少为 K 的最短子数组	困难		
// 470	用 Rand7() 实现 Rand10()	中等		
// 1 两数之和 简单		
// 329	矩阵中的最长递增路径	困难		
// 556	下一个更大元素 III	中等		
// 754	到达终点数字	中等		
// 489	扫地机器人	困难
// 143	重排链表	中等		
// 675	为高尔夫比赛砍树	困难		
// 93	复原IP地址	中等		
// 407	接雨水 II	困难		
// 1197	进击的骑士	中等		
// 2	两数相加	中等		
// 4	寻找两个有序数组的中	困难		
// 1032	字符流	困难		
// 499	迷宫 III	困难		
// 1040	移动石子直到连续 II	中等		
// 632	最小区间	困难		
// 3	无重复字符的最长子串	中等		
// 199	二叉树的右视图	中等		
// 421	数组中两个数的最大异或值	中等		
// 1125	最小的必要团队	困难		
// 426	将二叉搜索树转化为排序的双向链表	中等		
// 962	最大宽度坡	中等		
// 206	反转链表	简单		
// 1114	按序打印	简单		
// LCP 5	发 LeetCoin	困难
// 695	岛屿的最大面积	中等		
// 445	两数相加 II	中等		
// 185	部门工资前三高的所有员工	困难		
// 178	分数排名	中等		
// 950	按递增顺序显示卡牌	中等		
// 856	括号的分数	中等		
// 149	直线上最多的点数	困难		
// 410	分割数组的最大值	困难		
// 85	最大矩形	困难		
// 1238	循环码排列	中等		
// 777	在LR字符串中交换相邻字符	中等		
// 854	相似度为 K 的字符串	困难		
// 1074	元素和为目标值的子矩阵数量	困难		
// 382	链表随机节点	中等		
// 5	最长回文子串	中等		
// 314	二叉树的垂直遍历	中等		
// 679	24 点游戏	困难		
// 72	编辑距离	困难		
// 1205	每月交易II	中等		
// 488	祖玛游戏	困难
// 466	统计重复个数	困难		
// 253	会议室 II	中等		
// 1195	交替打印字符串	中等		
// 1092	最短公共超序列	困难		
// 718	最长重复子数组	中等		
// 583	两个字符串的删除操作	中等		
// 1095	山脉数组中查找目标值	困难		
// 192	统计词频	中等		
// 579	查询员工的累计薪水	困难		
// 1049	最后一块石头的重量 II
// 40.3%	中等		
// 518	零钱兑换 II	中等		
// 23	合并K个排序链表	困难		
// 1226	哲学家进餐	中等		
// 958	二叉树的完全性检验	中等		
// 56	合并区间	中等		
// 863	二叉树中所有距离为 K 的结点	中等		
// 1269	停在原地的方案数	困难		
// 312	戳气球	困难		
// 851	喧闹和富有	中等		
// 662	二叉树最大宽度	中等		
// 987	二叉树的垂序遍历	中等		
// 11	盛最多水的容器	中等		
// 764	最大加号标志	中等		
// 218	天际线问题	困难		
// 480	滑动窗口中位数	困难		
// 103	二叉树的锯齿形层次遍历	中等		
// 797	所有可能的路径	中等		
// 924	尽量减少恶意软件的传播	困难		
// 385	迷你语法分析器	中等		
// 569	员工薪水中位数	困难		
// 652	寻找重复的子树	中等		
// 870	优势洗牌	中等		
// 994	腐烂的橘子	简单		
// 33	搜索旋转排序数组	中等		
// 15	三数之和	中等		
// 259	较小的三数之和	中等		
// 398	随机数索引	中等		
// 361	轰炸敌人	中等		
// 885	螺旋矩阵 III	中等		
// 1146	快照数组	中等
// 673	最长递增子序列的个数	中等		
// 124	二叉树中的最大路径	困难		
// 400	第N个数字	中等		
// 731	我的日程安排表 II 中等		
// 1098	小众书籍	中等		
// LCP 2	分式化简	简单		
// 1139	最大的以 1 为边界的正方形	中等		
// 267	回文排列 II	中等		
// 799	香槟塔	中等		
// 1201	丑数 III	中等		
// 41	缺失的第一个正数	困难		
// 741	摘樱桃	困难		
// 562	矩阵中最长的连续1线段	中等		
// 10	正则表达式匹配	困难		
// 678	有效的括号字符串	中等		
// 442	数组中重复的数据	中等		
// 31	下一个排列	中等		
// 322	零钱兑换	中等		
// 97	交错字符串	困难		
// 215	数组中的第K个最大元素	中等
// 1091	二进制矩阵中的最短路径	中等		
// 286	墙与门	中等		
// 1224	最大相等频率	困难		
// 716	最大栈	简单		
// 45	跳跃游戏 II	困难		
// 121	买卖股票的最佳时机	简单		
// 903	DI 序列的有效排列	困难		
// 08.06 汉诺塔问题	简单		
// 79 单词搜索	中等		
// 224	基本计算器	困难		
// 223	矩形面积	中等		
// 721	账户合并	中等		
// 176	第二高的薪水	简单		
// 394	字符串解码	中等		
// 639	解码方法 2	困难		
// 32	最长有效括号	困难		
// 1008	先序遍历构造二叉树	中等		
// 71	简化路径	中等		
// 468	验证IP地址	中等		
// 297	二叉树的序列化与反序列化	困难
// 611	有效三角形的个数	中等		
// 46	全排列	中等		
// 546	移除盒子	困难		
// 560	和为K的子数组	中等		
// 1019	链表中的下一个更大节点	中等		
// 195	第十行	简单		
// 912	排序数组	中等		
// 1024	视频拼接	中等		
// 403	青蛙过河	困难		
// 596	超过5名学生的课	简单		
// 758	字符串中的加粗单词	简单		
// 478	在圆内随机生成点	中等		
// 986	区间列表的交集	中等		
// 214	最短回文串	困难		
// 778	水位上升的泳池中游泳	困难		
// 298	二叉树最长连续序列	中等		
// 1247	交换字符使得字符串相同	中等		
// 134	加油站	中等		
// 209	长度最小的子数组	中等		
// 552	学生出勤记录 II	困难
