388	
文件的最长绝对路径
44.0%	中等		
681	
最近时刻
47.3%	中等		
683	
K 个空花盆
37.0%	困难		
489	
扫地机器人
71.0%	困难		
308	
二维区域和检索 - 可变
55.7%	困难		
975	
奇偶跳
40.6%	困难		
904	
水果成篮
38.2%	中等		
1007	
行相等的最少多米诺旋转
43.5%	中等		
843	
猜猜这个单词
31.6%	困难		
642	
设计搜索自动补全系统
40.6%	困难		
465	
最优账单平衡
43.8%	困难		
1088	
易混淆数 II
34.8%	困难		
271	
字符串的编码与解码
51.0%	中等		
425	
单词方块
50.6%	困难		
753	
破解保险箱
51.9%	困难		
418	
屏幕可显示句子的数量
33.3%	中等		
568	
最大休假天数
45.4%	困难		
929	
独特的电子邮件地址
63.8%	简单		
158	
用 Read4 读取 N 个字符 II
55.9%	困难		
857	
雇佣 K 名工人的最低成本
39.3%	困难
1153	
字符串转化
31.3%	困难		
1057	
校园自行车分配
35.1%	中等		
1231	
分享巧克力
53.0%	困难		
471	
编码最短长度的字符串
50.7%	困难		
340	
至多包含 K 个不同字符的最长子串
47.0%	困难		
1055	
形成字符串的最短路径
50.4%	中等		
288	
单词的唯一缩写
30.9%	中等		
774	
最小化去加油站的最大距离
52.4%	困难		
737	
句子相似性 II
38.8%	中等		
281	
锯齿迭代器
70.7%	中等		
296	
最佳的碰头地点
62.5%	困难		
616	
给字符串添加加粗标签
43.5%	中等		
1096	
花括号展开 II
48.3%	困难		
939	
最小面积矩形
42.2%	中等		
317	
离建筑物最近的距离
42.7%	困难		
361	
轰炸敌人
51.9%	中等		
298	
二叉树最长连续序列
54.2%	中等		
734	
句子相似性
48.9%	简单		
1087	
字母切换
44.8%	中等		
305	
岛屿数量 II
31.6%	困难
482	
密钥格式化
38.8%	简单		
947	
移除最多的同行或同列石头
47.9%	中等		
803	
打砖块
23.7%	困难		
1066	
校园自行车分配 II
36.9%	中等		
727	
最小窗口子序列
39.4%	困难		
163	
缺失的区间
24.8%	中等		
248	
中心对称数 III
41.6%	困难		
750	
角矩形的数量
73.0%	中等		
723	
粉碎糖果
66.8%	中等		
1168	
水资源分配优化
39.4%	困难		
527	
单词缩写
47.1%	困难		
269	
火星词典
40.2%	困难		
359	
日志速率限制器
68.3%	简单		
809	
情感丰富的文字
39.4%	中等		
708	
循环有序列表的插入
29.3%	中等		
981	
基于时间的键值存储
36.5%	中等		
1032	
字符流
30.8%	困难		
913	
猫和老鼠
30.1%	困难		
351	
安卓系统手势解锁
60.2%	中等		
159	
至多包含两个不同字符的最长子串
51.1%	中等
247	
中心对称数 II
48.2%	中等		
686	
重复叠加字符串匹配
33.6%	简单		
544	
输出比赛匹配对
65.1%	中等		
772	
基本计算器 III
32.3%	困难		
850	
矩形面积 II
39.5%	困难		
320	
列举单词的全部缩写
61.3%	中等		
411	
最短特异单词缩写
44.7%	困难		
157	
用 Read4 读取 N 个字符
50.9%	简单		
490	
迷宫
44.8%	中等		
1197	
进击的骑士
28.7%	中等		
428	
序列化和反序列化 N 叉树
59.6%	困难		
818	
赛车
32.4%	困难		
562	
矩阵中最长的连续1线段
38.1%	中等		
444	
序列重建
23.2%	中等		
900	
RLE 迭代器
42.7%	中等		
294	
翻转游戏 II
56.6%	中等		
393	
UTF-8 编码验证
37.6%	中等		
218	
天际线问题
40.7%	困难		
855	
考场就座
31.8%	中等		
943	
最短超级串
37.4%	困难
770	
基本计算器 IV
43.8%	困难		
379	
电话目录管理系统
66.0%	中等		
484	
寻找排列
64.4%	中等		
604	
迭代压缩字符串
35.5%	简单		
369	
给单链表加一
58.8%	中等		
935	
骑士拨号器
40.7%	中等		
304	
二维区域和检索 - 矩阵不可变
42.5%	中等		
552	
学生出勤记录 II
38.2%	困难		
427	
建立四叉树
56.9%	中等		
403	
青蛙过河
32.3%	困难		
1136	
平行课程
49.3%	困难		
1048	
最长字符串链
39.8%	中等		
422	
有效的单词方块
41.6%	简单		
951	
翻转等价二叉树
62.0%	中等		
250	
统计同值子树
62.3%	中等		
635	
设计日志存储系统
53.6%	中等		
370	
区间加法
64.6%	中等		
291	
单词规律 II
53.1%	困难		
276	
栅栏涂色
43.1%	简单		
659	
分割数组为连续子序列
40.3%	中等
286	
墙与门
43.7%	中等		
302	
包含全部黑色像素的最小矩形
70.4%	困难		
325	
和等于 k 的最长子数组长度
46.8%	中等		
311	
稀疏矩阵的乘法
74.7%	中等		
149	
直线上最多的点数
20.7%	困难		
261	
以图判树
44.8%	中等		
469	
凸多边形
43.9%	中等		
289	
生命游戏
69.0%	中等		
380	
常数时间插入、删除和获取随机元素
47.9%	中等		
282	
给表达式添加运算符
32.4%	困难		
277	
搜寻名人
57.2%	中等		
431	
将 N 叉树编码为二叉树
68.0%	困难		
299	
猜数字游戏
47.0%	简单		
849	
到最近的人的最大距离
39.0%	简单		
533	
孤独像素 II
45.5%	中等		
1272	
删除区间
47.3%	中等		
348	
判定井字棋胜负
56.1%	中等		
499	
迷宫 III
30.7%	困难		
407	
接雨水 II
34.6%	困难		
336	
回文对
33.1%	困难
1284	
转化为全零矩阵的最少反转次数
65.1%	困难		
295	
数据流的中位数
42.9%	困难		
609	
在系统中查找重复文件
55.2%	中等		
672	
灯泡开关 Ⅱ
53.1%	中等		
341	
扁平化嵌套列表迭代器
62.1%	中等		
270	
最接近的二叉搜索树值
50.2%	简单		
394	
字符串解码
48.7%	中等		
146	
LRU缓存机制
45.9%	中等		
529	
扫雷游戏
59.2%	中等		
801	
使序列递增的最小交换次数
36.9%	中等		
375	
猜数字大小 II
37.1%	中等		
676	
实现一个魔法字典
55.7%	中等		
879	
盈利计划
31.3%	困难		
1011	
在 D 天内送达包裹的能力
50.9%	中等		
805	
数组的均值分割
25.0%	困难		
792	
匹配子序列的单词数
41.8%	中等		
297	
二叉树的序列化与反序列化
44.8%	困难		
274	
H指数
37.8%	中等		
630	
课程表 III
28.6%	困难		
1121	
将数组分成几个递增序列
49.2%	困难		
