736	
Lisp 语法解析
40.1%	困难		
679	
24 点游戏
41.8%	困难		
782	
变为棋盘
40.9%	困难		
850	
矩形面积 II
39.5%	困难		
1106	
解析布尔表达式
53.5%	困难		
815	
公交路线
30.2%	困难		
741	
摘樱桃
30.3%	困难		
631	
设计 Excel 求和公式
23.9%	困难		
820	
单词的压缩编码
40.0%	中等		
499	
迷宫 III
30.7%	困难		
1109	
航班预订统计
39.4%	中等		
403	
青蛙过河
32.3%	困难		
1151	
最少交换次数来组合所有的 1
41.9%	中等		
1245	
树的直径
42.3%	中等		
385	
迷你语法分析器
40.0%	中等		
600	
不含连续1的非负整数
29.9%	困难		
593	
有效的正方形
41.0%	中等		
554	
砖墙
35.2%	中等		
394	
字符串解码
48.7%	中等		
面试题 16.26	
计算器
32.1%	中等
316	
去除重复字母
37.4%	困难		
799	
香槟塔
35.0%	中等		
843	
猜猜这个单词
31.6%	困难		
85	
最大矩形
44.5%	困难		
562	
矩阵中最长的连续1线段
38.1%	中等		
423	
从英文中重建数字
51.9%	中等		
1031	
两个非重叠子数组的最大和
49.8%	中等		
254	
因子的组合
55.0%	中等		
355	
设计推特
36.8%	中等		
362	
敲击计数器
68.0%	中等		
1162	
地图分析
38.3%	中等		
221	
最大正方形
39.1%	中等		
639	
解码方法 2
26.1%	困难		
323	
无向图中连通分量的数目
54.8%	中等		
43	
字符串相乘
41.8%	中等		
758	
字符串中的加粗单词
42.6%	简单		
45	
跳跃游戏 II
33.2%	困难		
870	
优势洗牌
35.7%	中等		
778	
水位上升的泳池中游泳
46.2%	困难		
5	
最长回文子串
28.7%	中等		
1044	
最长重复子串
16.4%	困难		
539	
最小时间差
53.9%	中等		
1163	
按字典序排在最后的子串
21.9%	困难		
224	
基本计算器
36.8%	困难		
192	
统计词频
33.8%	中等		
227	
基本计算器 II
34.8%	中等		
491	
递增子序列
45.7%	中等		
32	
最长有效括号
29.7%	困难		
987	
二叉树的垂序遍历
37.7%	中等		
801	
使序列递增的最小交换次数
36.9%	中等		
515	
在每个树行中找最大值
58.5%	中等		
638	
大礼包
57.3%	中等		
583	
两个字符串的删除操作
47.5%	中等		
735	
行星碰撞
37.6%	中等		
992	
K 个不同整数的子数组
25.6%	困难		
582	
杀死进程
34.3%	中等		
289	
生命游戏
69.0%	中等		
325	
和等于 k 的最长子数组长度
46.9%	中等		
93	
复原IP地址
45.9%	中等		
37	
解数独
59.8%	困难		
1160	
拼写单词
64.9%	简单		
997	
找到小镇的法官
50.2%	简单		
354	
俄罗斯套娃信封问题
33.8%	困难		
72	
编辑距离
56.4%	困难		
1262	
可被三整除的最大和
44.2%	中等		
1165	
单行键盘
81.4%	简单		
3	
无重复字符的最长子串
33.1%	中等		
200	
岛屿数量
47.1%	中等		
1027	
最长等差数列
40.8%	中等		
791	
自定义字符串排序
65.6%	中等		
406	
根据身高重建队列
62.7%	中等		
186	
翻转字符串里的单词 II
72.8%	中等		
163	
缺失的区间
24.8%	中等		
301	
删除无效的括号
45.5%	困难		
442	
数组中重复的数据
63.9%	中等		
233	
数字 1 的个数
33.0%	困难		
1267	
统计参与通信的服务器
58.2%	中等		
419	
甲板上的战舰
71.3%	中等		
187	
重复的DNA序列
43.9%	中等		
739	
每日温度
58.7%	中等		

652	
寻找重复的子树
52.6%	中等		
557	
反转字符串中的单词 III
69.5%	简单		
1239	
串联字符串的最大长度
37.6%	中等		
468	
验证IP地址
21.5%	中等		
20	
有效的括号
41.0%	简单		
621	
任务调度器
48.0%	中等		
862	
和至少为 K 的最短子数组
13.3%	困难		
1019	
链表中的下一个更大节点
51.1%	中等		
7	
整数反转
33.7%	简单		
313	
超级丑数
61.3%	中等		
193	
有效电话号码
28.0%	简单		
402	
移掉K位数字
28.0%	中等		
214	
最短回文串
31.4%	困难		
1143	
最长公共子序列
58.4%	中等		
435	
无重叠区间
44.5%	中等		
322	
零钱兑换
37.8%	中等		
875	
爱吃香蕉的珂珂
39.7%	中等		
42	
接雨水
48.9%	困难		
2	
两数相加
36.7%	中等		
343	
整数拆分
54.5%	中等		