348	判定井字棋胜负	中等		
642	设计搜索自动补全系统	困难		
277	搜寻名人	中等		
273	整数转换英文表示	困难		
428	序列化和反序列化 N 叉树	困难		
545	二叉树的边界	中等		
186	翻转字符串里的单词 II	中等		
285	二叉搜索树中的顺序后继	中等		
253	会议室 II	中等		
722	删除注释	中等		
138	复制带随机指针的链表	中等		
218	天际线问题	困难		
636	函数的独占时间	中等		
772	基本计算器 III	困难		
419	甲板上的战舰	中等		
564	寻找最近的回文数	困难		
431	将 N 叉树编码为二叉树	困难		
269	火星词典	困难		
362	敲击计数器	中等		
1279	红绿灯路口	简单		
591	标签验证器	困难		
708	循环有序列表的插入	中等		
489	扫地机器人	困难		
972	相等的有理数	困难		
158	用 Read4 读取 N 个字符 II	困难		
151	翻转字符串里的单词	中等		
588	设计内存文件系统	困难		
1273	删除树节点	中等		
935	骑士拨号器	中等		
794	有效的井字游戏	中等		
694	不同岛屿的数量	中等		
535	TinyURL 的加密与解密	中等		
490	迷宫	中等		
379	电话目录管理系统	中等		
805	数组的均值分割	困难		
727	最小窗口子序列	困难		
314	二叉树的垂直遍历	中等		
702	搜索长度未知的有序数组	中等		
449	序列化和反序列化二叉搜索树	中等		
460	LFU缓存	困难		
836	矩形重叠	简单		
651	4键键盘	中等		
510	二叉搜索树中的中序后继 II	中等		
358	K 距离间隔重排字符串	困难		
146	LRU缓存机制	中等		
688	“马”在棋盘上的概率	中等		
346	数据流中的移动平均值	简单		
297	二叉树的序列化与反序列化	困难		
631	设计 Excel 求和公式	困难		
402 移掉K位数字 中等		
224 基本计算器	困难		
909	蛇梯棋	中等		
353	贪吃蛇	中等		
252	会议室	简单		
1197	进击的骑士	中等		
223	矩形面积	中等		
568	最大休假天数	困难		
450	删除二叉搜索树中的节点	中等		
1285	找到连续区间的开始和结束数字	中等		
212	单词搜索 II	困难
426	将二叉搜索树转化为排序的双向链表	中等		
165	比较版本号	中等		
457	环形数组循环	中等		
528	按权重随机选择  中等		
351	安卓系统手势解锁	中等		
432	全 O(1) 的数据结构	困难		
1198	找出所有行中最小公共元素	中等		
729	我的日程安排表 I	中等		
759	员工空闲时间	困难		
445	两数相加 II	中等		
161	相隔为 1 的编辑距离	中等		
1246	删除回文子数组	困难		
116	填充每个节点的下一个右侧节点指针	中等		
308	二维区域和检索 - 可变	困难		
356	直线镜像	中等		
403	青蛙过河	困难		
1136	平行课程	困难		
1067	范围内的数字计数	困难		
340	至多包含 K 个不同字符的最长子串	困难		
679	24 点游戏	困难		
333	
最大 BST 子树
41.8%	中等		
280	
摆动排序
68.6%	中等		
1239	
串联字符串的最大长度
37.6%	中等		
885	
螺旋矩阵 III
64.0%	中等		
1187	
使数组严格递增
38.6%	困难		
716	
最大栈
43.0%	简单		
706	
设计哈希映射
56.1%	简单		
140	
单词拆分 II
37.8%	困难		
529	
扫雷游戏
59.2%	中等		
384	
打乱数组
49.8%	中等		
54	
螺旋矩阵
38.8%	中等		
1092	
最短公共超序列
39.6%	困难		
863	
二叉树中所有距离为 K 的结点
47.0%	中等		
286	
墙与门
43.7%	中等		
295	
数据流的中位数
42.9%	困难		
117	
填充每个节点的下一个右侧节点指针 II
45.2%	中等		
407	
接雨水 II
34.6%	困难		
271	
字符串的编码与解码
51.0%	中等		
103	
二叉树的锯齿形层次遍历
53.7%	中等		
672	
灯泡开关 Ⅱ
53.1%	中等