// 555   分割连接字符串
// 1236  网络爬虫
// 1096  花括号展开II
// 587   暗转栅栏
// 913   猫和老鼠
// 810   黑板异或游戏
// 548   将数组分割成和相等的子数组
// 805   数组的均值分割
// 839   相似字符串组
// 688 "马"在棋盘上的概率
// 479 最大回文数乘集
// 666 路径和IV
// 675 为高尔夫比赛砍树
// 458 可怜的小猪
// 146 LRU缓存机制
// 803 打砖块
// 1188 设计优先阻塞队列
// 460  LFU缓存
// 446 等差数列划分II - 子序列
// 535 TinyURL的加密和解密 
// 1012 至少有1位重复的数字
// 761  特殊的二进制序列
// 956  最高的广告牌
// 1    两数之和
// 4    寻找两个有序数组的中位数
// 732  阶乘函数后K个零
// 642  设计搜索自动补全系统
// 1116 打印零与奇偶数
// 772  基本计算器III
// 710  黑名单中的随机数
// 1115 交替打印FooBar
// 847  访问所有节点的最短路径
// 601  体育馆的人流量
// 192  统计词频
// 393  UTF-8编码验证
// 193  有效电话号码
// 1226 哲学家进餐
// 420  强密码检验器
// 312  戳气球
// 764	最大加号标志	中等		
// 517	超级洗衣机 	困难		
// 185	部门工资前三高的所有员工 困难		
// 885	螺旋矩阵 III	中等		
// 361	轰炸敌人　中等		
// 992 K 个不同整数的子数组	困难		
// 277 搜寻名人	中等		
// 311	稀疏矩阵的乘法	中等		
// 3   无重复字符的最长子串	中等		
// 493	翻转对	困难		
// 834	树中距离之和	困难		
// 178 分数排名	中等		
// 5	  最长回文子串	中等		
// 741 摘樱桃	困难		
// 678 有效的括号字符串	中等		
// 214 最短回文串	困难
// 386	字典序排数 中等		
// 612	平面上的最近距离 中等		
// 486	预测赢家	中等		
// 1054	距离相等的条形码 中等
// 1043	分隔数组以得到最大和中等		
// 206	反转链表	简单		
// 1114 按序打印	简单		
// 369	给单链表加一	中等		
// 836	矩形重叠	简单		
// 184	部门工资最高的员工	中等		
// 138	复制带随机指针的链表	中等		
// 255	验证前序遍历序列二叉搜索树	中等		
// 716 最大栈	简单		
// 65	有效数字	困难		
// 903	DI 序列的有效排列	困难		
// 695	岛屿的最大面积	中等		
// 2	两数相加	中等		
// 923	三数之和的多种可能	中等		
// 135	分发糖果	困难		
// 546 移除盒子	困难		
// 126	单词接龙 II	困难		
// 862	和至少为 K 的最短子数组	困难		
// 44	通配符匹配	困难		
// 743	网络延迟时间	中等
// 1024	视频拼接  中等		
// 718	最长重复子数组	中等		
// 540	有序数组中的单一元素	中等		
// 164	最大间距	困难		
// 140	单词拆分 II	困难		
// 848	字母移位	中等		
// 382	链表随机节点	中等		
// 726	原子的数量	困难		
// 72	编辑距离	困难		
// 1044	最长重复子串 困难		
// 516	最长回文子序列	中等		
// 10	正则表达式匹配	困难		
// 954	二倍数对数组	中等		
// 880	索引处的解码字符串	中等		
// 42	接雨水	困难		
// 194	转置文件	中等		
// 815	公交路线	困难		
// 151	翻转字符串里的单词	中等		
// 1131	绝对值表达式的最大值  中等		
// 413	等差数列划分	中等
// 1293	网格中的最短路径	困难		
// 502	IPO	困难		
// 177	第N高的薪水	中等		
// 175	组合两个表	简单		
// 8	  字符串转换整数 (atoi)	中等		
// 153	寻找旋转排序数组中的最小值	中等		
// 673	最长递增子序列的个数	中等		
// 740	删除与获得点数	中等		
// 1124	表现良好的最长时间段  中等		
// 415	字符串相加	简单		
// 15	三数之和	中等		
// 388	文件的最长绝对路径	中等		
// 23	合并K个排序链表	困难		
// 280	摆动排序	中等		
// 124	二叉树中的最大路径和	困难		
// 440	字典序的第K小数字	困难		
// 229	求众数 II	中等		
// 436	寻找右区间	中等		
// 363	矩形区域不超过 K 的最大数值和	困难		
// 215	数组中的第K个最大元素	中等
// 638	大礼包	中等		
// 400	第N个数字	中等		
// 344	反转字符串	简单		
// 583	两个字符串的删除操作	中等		
// 692	前K个高频单词	中等		
// 792	匹配子序列的单词数	中等		
// 196	删除重复的电子邮箱	简单		
// 276	栅栏涂色	简单		
// 285	二叉搜索树中的顺序后继	中等		
// 1050	合作过至少三次的演员和导演	简单		
// 266	回文排列  简单		
// 149	直线上最多的点数	困难		
// 873	最长的斐波那契子序列的长度	中等		
// 33	搜索旋转排序数组	中等		
// 765	情侣牵手	困难		
// 25	K 个一组翻转链表	困难		
// 148	排序链表	中等		
// 802	找到最终的安全状态	中等		
// 853	车队	中等		
// 224	基本计算器	困难
// 143	重排链表	中等		
// 21	合并两个有序链表	简单		
// 7	整数反转	简单		
// 572	另一个树的子树	简单		
// 423	从英文中重建数字	中等		
// 464	我能赢吗  中等		
// 679	24 点游戏	困难		
// 934	最短的桥	中等		
// 9	回文数	简单		
// 176	第二高的薪水	简单		
// 197	上升的温度	简单		
// 371	两整数之和	简单		
// 354	俄罗斯套娃信封问题	困难		
// 1029	两地调度	简单		
// 1014	最佳观光组合	中等		
// 329	矩阵中的最长递增路径	困难		
// 56	合并区间	中等		
// 76	最小覆盖子串	困难		
// 377	组合总和 Ⅳ	中等		
// 450	删除二叉搜索树中的节点	中等
// 93	复原IP地址	中等		
// 22	括号生成	中等		
// 1195	交替打印字符串	中等		
// 127	单词接龙	中等		
// 322	零钱兑换	中等		
// 200	岛屿数量	中等		
// 336	回文对	困难		
// 179	最大数	中等		
// 687	最长同值路径	简单		
// 453	最小移动次数使数组元素相等	简单		
// 51	N皇后	困难		
// 1011	在 D 天内送达包裹的能力	中等		
// 286	墙与门	中等		
// 85	最大矩形	困难		
// 128	最长连续序列	困难		
// 186	翻转字符串里的单词 II	中等		
// 172	阶乘后的零	简单		
// 395	至少有K个重复字符的最长子串	中等		
// 20	有效的括号	简单		
// 46	全排列	中等
// 292	Nim 游戏	简单		
// 877	石子游戏	中等		
// 64	最小路径和	中等		
// 226	翻转二叉树	简单		
// 537	复数乘法	中等		
// 221	最大正方形	中等		
// 556	下一个更大元素 III	中等		
// 513	找树左下角的值	中等		
// 233	数字 1 的个数	困难		
// 50	Pow(x, n)	中等		
// 347	前 K 个高频元素	中等		
// 696	计数二进制子串	简单		
// 139	单词拆分	中等		
// 260	只出现一次的数字 III	中等		
// 147	对链表进行插入排序	中等		
// 657	机器人能否返回原点	简单		
// 232	用栈实现队列	简单		
// 106	从中序与后序遍历序列构造二叉树	中等		
// 477	汉明距离总和	中等		
// 187	重复的DNA序列	中等